Tekla.Structures.CatalogInternal.ImportFromGeometry
The structure specifying the source of importing a shape directly from a geometry file.

Tekla.Structures.CatalogInternal.ImportFromGeometry.GeometryIdentifier
Gets or sets the identifier which can be used to find the geometry within the file.

Tekla.Structures.CatalogInternal.ImportFromGeometry.ShapeName
Gets or sets the name of the shape.
Shape name can be at most Tekla.Structures.Catalogs.ShapeItem.MaxShapeNameLength characters long.

Tekla.Structures.CatalogInternal.ImportFromGeometry.CreateCustomPart
Always false as a custom part can not be created without providing a metadata.

Tekla.Structures.CatalogInternal.ImportFromGeometry.ToStruct
Creates an instance in internal struct.
Returns:
The Tekla.Structures.CatalogInternal.dotcatShapeImport_t.